backend/controllers/NewsController.php

SELECT COUNT(*) FROM `news` WHERE 1
---
    public function actionList()
    {
        $where = '';
        $bind = [];

        if (self::getQuery('title')!=='') {
            $where .= 'title like :title';
            $bind[':title'] = '%'.self::getQuery('title').'%';
        }

        if (self::getQuery('start')!=='') {
            $where .= ' AND dateline>=:start';
            $bind[':start'] = self::getQuery('start');
        }

        if (self::getQuery('end')!=='') {
            $where .= ' AND dateline<=:end';
            $bind[':end'] = self::getQuery('end');
        }

        $page = (int)self::getQuery('page', 1);
        $pagesize = (int)self::getQuery('pagesize', 10);

        $query = (new Query())
            ->from('news')
            ->where($where, $bind);

        $total = $query->count();
        $list = $query
            ->select(['id', 'title', 'dateline', 'cover'])
            ->orderBy(['dateline' => SORT_DESC])
            ->offset(($page-1)*$pagesize)
            ->limit($pagesize)
            ->all();